app/Http/Controllers/LeaderboardController.php

    public function singles(Request $request, $season_id = null) {
        $season = $season_id ? Season::find($season_id) : Season::current();
        $teams = $this->getLeaderboardTeams(1, $season)->get();
        return self::successfulResponse([
            'teams' => $teams->map(fn ($team) => [
                'id' => $team->id,
                'members' => $team->members,
                'elo' => $team->elo
            ]),
            'season_number' => $season->id
        ]);
---
SELECT * FROM `teams`