app/Models/Season.php

SELECT * FROM `seasons` ORDER BY `created_at` DESC LIMIT 1
---
    public static function current() {
        return self::latest()->first();